---
type: HermiteFace
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# HermiteFace

`Autodesk.Revit.DB.HermiteFace` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Intersect | — | `` |
| Method | IsInside | — | `` |
| Method | Triangulate | — | `` |
| Property | MixedDerivs | — | `public IList < XYZ > MixedDerivs { get ; }` |
| Property | Params | — | `public DoubleArray this [ int index ] { get ; }` |
| Property | Points | — | `public IList < XYZ > Points { get ; }` |
| Property | Tangents | — | `public IList < XYZ > this [ int index ] { get ; }` |